MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP32GS506/mcu.h
#define _SPI2STAT_SPIBEC_POSITION                0x00000008
#define _SPI2STAT_SPIBEC_MASK                    0x00000700
#define _SPI2STAT_SPIBEC_LENGTH                  0x00000003

#define _SPI2STAT_SPISIDL_POSITION               0x0000000D
#define _SPI2STAT_SPISIDL_MASK                   0x00002000
#define _SPI2STAT_SPISIDL_LENGTH                 0x00000001

#define _SPI2STAT_SPIEN_POSITION                 0x0000000F
#define _SPI2STAT_SPIEN_MASK                     0x00008000
#define _SPI2STAT_SPIEN_LENGTH                   0x00000001

#define _SPI2STAT_SISEL0_POSITION                0x00000002
#define _SPI2STAT_SISEL0_MASK                    0x00000004
#define _SPI2STAT_SISEL0_LENGTH                  0x00000001

#define _SPI2STAT_SISEL1_POSITION                0x00000003
#define _SPI2STAT_SISEL1_MASK                    0x00000008
#define _SPI2STAT_SISEL1_LENGTH                  0x00000001

#define _SPI2STAT_SISEL2_POSITION                0x00000004
#define _SPI2STAT_SISEL2_MASK                    0x00000010
#define _SPI2STAT_SISEL2_LENGTH                  0x00000001

#define _SPI2STAT_SPIBEC0_POSITION               0x00000008
#define _SPI2STAT_SPIBEC0_MASK                   0x00000100
#define _SPI2STAT_SPIBEC0_LENGTH                 0x00000001

#define _SPI2STAT_SPIBEC1_POSITION               0x00000009
#define _SPI2STAT_SPIBEC1_MASK                   0x00000200
#define _SPI2STAT_SPIBEC1_LENGTH                 0x00000001

#define _SPI2STAT_SPIBEC2_POSITION               0x0000000A
#define _SPI2STAT_SPIBEC2_MASK                   0x00000400
#define _SPI2STAT_SPIBEC2_LENGTH                 0x00000001

#define _SPI2CON1_PPRE_POSITION                  0x00000000
#define _SPI2CON1_PPRE_MASK                      0x00000003
#define _SPI2CON1_PPRE_LENGTH                    0x00000002

#define _SPI2CON1_SPRE_POSITION                  0x00000002
#define _SPI2CON1_SPRE_MASK                      0x0000001C
#define _SPI2CON1_SPRE_LENGTH                    0x00000003

#define _SPI2CON1_MSTEN_POSITION                 0x00000005
#define _SPI2CON1_MSTEN_MASK                     0x00000020
#define _SPI2CON1_MSTEN_LENGTH                   0x00000001

#define _SPI2CON1_CKP_POSITION                   0x00000006
#define _SPI2CON1_CKP_MASK                       0x00000040
#define _SPI2CON1_CKP_LENGTH                     0x00000001

#define _SPI2CON1_SSEN_POSITION                  0x00000007
#define _SPI2CON1_SSEN_MASK                      0x00000080
#define _SPI2CON1_SSEN_LENGTH                    0x00000001

#define _SPI2CON1_CKE_POSITION                   0x00000008
#define _SPI2CON1_CKE_MASK                       0x00000100
#define _SPI2CON1_CKE_LENGTH                     0x00000001

#define _SPI2CON1_SMP_POSITION                   0x00000009
#define _SPI2CON1_SMP_MASK                       0x00000200
#define _SPI2CON1_SMP_LENGTH                     0x00000001

#define _SPI2CON1_MODE16_POSITION                0x0000000A
#define _SPI2CON1_MODE16_MASK                    0x00000400
#define _SPI2CON1_MODE16_LENGTH                  0x00000001

#define _SPI2CON1_DISSDO_POSITION                0x0000000B
#define _SPI2CON1_DISSDO_MASK                    0x00000800
#define _SPI2CON1_DISSDO_LENGTH                  0x00000001

#define _SPI2CON1_DISSCK_POSITION                0x0000000C
#define _SPI2CON1_DISSCK_MASK                    0x00001000
#define _SPI2CON1_DISSCK_LENGTH                  0x00000001

#define _SPI2CON1_PPRE0_POSITION                 0x00000000
#define _SPI2CON1_PPRE0_MASK                     0x00000001
#define _SPI2CON1_PPRE0_LENGTH                   0x00000001

#define _SPI2CON1_PPRE1_POSITION                 0x00000001
#define _SPI2CON1_PPRE1_MASK                     0x00000002
#define _SPI2CON1_PPRE1_LENGTH                   0x00000001

#define _SPI2CON1_SPRE0_POSITION                 0x00000002
#define _SPI2CON1_SPRE0_MASK                     0x00000004
#define _SPI2CON1_SPRE0_LENGTH                   0x00000001

#define _SPI2CON1_SPRE1_POSITION                 0x00000003
#define _SPI2CON1_SPRE1_MASK                     0x00000008
#define _SPI2CON1_SPRE1_LENGTH                   0x00000001

#define _SPI2CON1_SPRE2_POSITION                 0x00000004
#define _SPI2CON1_SPRE2_MASK                     0x00000010
#define _SPI2CON1_SPRE2_LENGTH                   0x00000001

#define _SPI2CON2_SPIBEN_POSITION                0x00000000
#define _SPI2CON2_SPIBEN_MASK                    0x00000001
#define _SPI2CON2_SPIBEN_LENGTH                  0x00000001

#define _SPI2CON2_FRMDLY_POSITION                0x00000001
#define _SPI2CON2_FRMDLY_MASK                    0x00000002
#define _SPI2CON2_FRMDLY_LENGTH                  0x00000001

#define _SPI2CON2_FRMPOL_POSITION                0x0000000D
#define _SPI2CON2_FRMPOL_MASK                    0x00002000
#define _SPI2CON2_FRMPOL_LENGTH                  0x00000001

#define _SPI2CON2_SPIFSD_POSITION                0x0000000E
#define _SPI2CON2_SPIFSD_MASK                    0x00004000
#define _SPI2CON2_SPIFSD_LENGTH                  0x00000001

#define _SPI2CON2_FRMEN_POSITION                 0x0000000F
#define _SPI2CON2_FRMEN_MASK                     0x00008000
#define _SPI2CON2_FRMEN_LENGTH                   0x00000001

#define _ADCON1L_ADSIDL_POSITION                 0x0000000D
#define _ADCON1L_ADSIDL_MASK                     0x00002000
#define _ADCON1L_ADSIDL_LENGTH                   0x00000001

#define _ADCON1L_ADON_POSITION                   0x0000000F
#define _ADCON1L_ADON_MASK                       0x00008000
#define _ADCON1L_ADON_LENGTH                     0x00000001

#define _ADCON1H_SHRRES_POSITION                 0x00000005
#define _ADCON1H_SHRRES_MASK                     0x00000060
#define _ADCON1H_SHRRES_LENGTH                   0x00000002

#define _ADCON1H_FORM_POSITION                   0x00000007
#define _ADCON1H_FORM_MASK                       0x00000080
#define _ADCON1H_FORM_LENGTH                     0x00000001

#define _ADCON1H_SHRRES0_POSITION                0x00000005
#define _ADCON1H_SHRRES0_MASK                    0x00000020
#define _ADCON1H_SHRRES0_LENGTH                  0x00000001

#define _ADCON1H_SHRRES1_POSITION                0x00000006
#define _ADCON1H_SHRRES1_MASK                    0x00000040
#define _ADCON1H_SHRRES1_LENGTH                  0x00000001

#define _ADCON2L_SHRADCS_POSITION                0x00000000
#define _ADCON2L_SHRADCS_MASK                    0x0000007F
#define _ADCON2L_SHRADCS_LENGTH                  0x00000007

#define _ADCON2L_SHREISEL_POSITION               0x00000008
#define _ADCON2L_SHREISEL_MASK                   0x00000700
#define _ADCON2L_SHREISEL_LENGTH                 0x00000003

#define _ADCON2L_EIEN_POSITION                   0x0000000C
#define _ADCON2L_EIEN_MASK                       0x00001000
#define _ADCON2L_EIEN_LENGTH                     0x00000001

#define _ADCON2L_REFERCIE_POSITION               0x0000000E
#define _ADCON2L_REFERCIE_MASK                   0x00004000
#define _ADCON2L_REFERCIE_LENGTH                 0x00000001

#define _ADCON2L_REFCIE_POSITION                 0x0000000F
#define _ADCON2L_REFCIE_MASK                     0x00008000
#define _ADCON2L_REFCIE_LENGTH                   0x00000001

#define _ADCON2L_SHRADCS0_POSITION               0x00000000
#define _ADCON2L_SHRADCS0_MASK                   0x00000001
#define _ADCON2L_SHRADCS0_LENGTH                 0x00000001

#define _ADCON2L_SHRADCS1_POSITION               0x00000001
#define _ADCON2L_SHRADCS1_MASK                   0x00000002
#define _ADCON2L_SHRADCS1_LENGTH                 0x00000001

