MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP32GS506/mcu.h
#define _RPOR18_RP181R1_POSITION                 0x00000009
#define _RPOR18_RP181R1_MASK                     0x00000200
#define _RPOR18_RP181R1_LENGTH                   0x00000001

#define _RPOR18_RP181R2_POSITION                 0x0000000A
#define _RPOR18_RP181R2_MASK                     0x00000400
#define _RPOR18_RP181R2_LENGTH                   0x00000001

#define _RPOR18_RP181R3_POSITION                 0x0000000B
#define _RPOR18_RP181R3_MASK                     0x00000800
#define _RPOR18_RP181R3_LENGTH                   0x00000001

#define _RPOR18_RP181R4_POSITION                 0x0000000C
#define _RPOR18_RP181R4_MASK                     0x00001000
#define _RPOR18_RP181R4_LENGTH                   0x00000001

#define _RPOR18_RP181R5_POSITION                 0x0000000D
#define _RPOR18_RP181R5_MASK                     0x00002000
#define _RPOR18_RP181R5_LENGTH                   0x00000001

#define _RPINR0_INT1R_POSITION                   0x00000008
#define _RPINR0_INT1R_MASK                       0x0000FF00
#define _RPINR0_INT1R_LENGTH                     0x00000008

#define _RPINR0_INT1R0_POSITION                  0x00000008
#define _RPINR0_INT1R0_MASK                      0x00000100
#define _RPINR0_INT1R0_LENGTH                    0x00000001

#define _RPINR0_INT1R1_POSITION                  0x00000009
#define _RPINR0_INT1R1_MASK                      0x00000200
#define _RPINR0_INT1R1_LENGTH                    0x00000001

#define _RPINR0_INT1R2_POSITION                  0x0000000A
#define _RPINR0_INT1R2_MASK                      0x00000400
#define _RPINR0_INT1R2_LENGTH                    0x00000001

#define _RPINR0_INT1R3_POSITION                  0x0000000B
#define _RPINR0_INT1R3_MASK                      0x00000800
#define _RPINR0_INT1R3_LENGTH                    0x00000001

#define _RPINR0_INT1R4_POSITION                  0x0000000C
#define _RPINR0_INT1R4_MASK                      0x00001000
#define _RPINR0_INT1R4_LENGTH                    0x00000001

#define _RPINR0_INT1R5_POSITION                  0x0000000D
#define _RPINR0_INT1R5_MASK                      0x00002000
#define _RPINR0_INT1R5_LENGTH                    0x00000001

#define _RPINR0_INT1R6_POSITION                  0x0000000E
#define _RPINR0_INT1R6_MASK                      0x00004000
#define _RPINR0_INT1R6_LENGTH                    0x00000001

#define _RPINR0_INT1R7_POSITION                  0x0000000F
#define _RPINR0_INT1R7_MASK                      0x00008000
#define _RPINR0_INT1R7_LENGTH                    0x00000001

#define _RPINR1_INT2R_POSITION                   0x00000000
#define _RPINR1_INT2R_MASK                       0x000000FF
#define _RPINR1_INT2R_LENGTH                     0x00000008

#define _RPINR1_INT2R0_POSITION                  0x00000000
#define _RPINR1_INT2R0_MASK                      0x00000001
#define _RPINR1_INT2R0_LENGTH                    0x00000001

#define _RPINR1_INT2R1_POSITION                  0x00000001
#define _RPINR1_INT2R1_MASK                      0x00000002
#define _RPINR1_INT2R1_LENGTH                    0x00000001

#define _RPINR1_INT2R2_POSITION                  0x00000002
#define _RPINR1_INT2R2_MASK                      0x00000004
#define _RPINR1_INT2R2_LENGTH                    0x00000001

#define _RPINR1_INT2R3_POSITION                  0x00000003
#define _RPINR1_INT2R3_MASK                      0x00000008
#define _RPINR1_INT2R3_LENGTH                    0x00000001

#define _RPINR1_INT2R4_POSITION                  0x00000004
#define _RPINR1_INT2R4_MASK                      0x00000010
#define _RPINR1_INT2R4_LENGTH                    0x00000001

#define _RPINR1_INT2R5_POSITION                  0x00000005
#define _RPINR1_INT2R5_MASK                      0x00000020
#define _RPINR1_INT2R5_LENGTH                    0x00000001

#define _RPINR1_INT2R6_POSITION                  0x00000006
#define _RPINR1_INT2R6_MASK                      0x00000040
#define _RPINR1_INT2R6_LENGTH                    0x00000001

#define _RPINR1_INT2R7_POSITION                  0x00000007
#define _RPINR1_INT2R7_MASK                      0x00000080
#define _RPINR1_INT2R7_LENGTH                    0x00000001

#define _RPINR2_T1CKR_POSITION                   0x00000008
#define _RPINR2_T1CKR_MASK                       0x0000FF00
#define _RPINR2_T1CKR_LENGTH                     0x00000008

#define _RPINR2_T1CKRR_POSITION                  0x00000008
#define _RPINR2_T1CKRR_MASK                      0x0000FF00
#define _RPINR2_T1CKRR_LENGTH                    0x00000008

#define _RPINR2_T1CKRR0_POSITION                 0x00000008
#define _RPINR2_T1CKRR0_MASK                     0x00000100
#define _RPINR2_T1CKRR0_LENGTH                   0x00000001

#define _RPINR2_T1CKRR1_POSITION                 0x00000009
#define _RPINR2_T1CKRR1_MASK                     0x00000200
#define _RPINR2_T1CKRR1_LENGTH                   0x00000001

#define _RPINR2_T1CKRR2_POSITION                 0x0000000A
#define _RPINR2_T1CKRR2_MASK                     0x00000400
#define _RPINR2_T1CKRR2_LENGTH                   0x00000001

#define _RPINR2_T1CKRR3_POSITION                 0x0000000B
#define _RPINR2_T1CKRR3_MASK                     0x00000800
#define _RPINR2_T1CKRR3_LENGTH                   0x00000001

#define _RPINR2_T1CKRR4_POSITION                 0x0000000C
#define _RPINR2_T1CKRR4_MASK                     0x00001000
#define _RPINR2_T1CKRR4_LENGTH                   0x00000001

#define _RPINR2_T1CKRR5_POSITION                 0x0000000D
#define _RPINR2_T1CKRR5_MASK                     0x00002000
#define _RPINR2_T1CKRR5_LENGTH                   0x00000001

#define _RPINR2_T1CKRR6_POSITION                 0x0000000E
#define _RPINR2_T1CKRR6_MASK                     0x00004000
#define _RPINR2_T1CKRR6_LENGTH                   0x00000001

#define _RPINR2_T1CKRR7_POSITION                 0x0000000F
#define _RPINR2_T1CKRR7_MASK                     0x00008000
#define _RPINR2_T1CKRR7_LENGTH                   0x00000001

#define _RPINR2_T1CKR0_POSITION                  0x00000008
#define _RPINR2_T1CKR0_MASK                      0x00000100
#define _RPINR2_T1CKR0_LENGTH                    0x00000001

#define _RPINR2_T1CKR1_POSITION                  0x00000009
#define _RPINR2_T1CKR1_MASK                      0x00000200
#define _RPINR2_T1CKR1_LENGTH                    0x00000001

#define _RPINR2_T1CKR2_POSITION                  0x0000000A
#define _RPINR2_T1CKR2_MASK                      0x00000400
#define _RPINR2_T1CKR2_LENGTH                    0x00000001

#define _RPINR2_T1CKR3_POSITION                  0x0000000B
#define _RPINR2_T1CKR3_MASK                      0x00000800
#define _RPINR2_T1CKR3_LENGTH                    0x00000001

