MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP32GS506/mcu.h
#define _STRIG4_STRGCMP2_POSITION                0x00000005
#define _STRIG4_STRGCMP2_MASK                    0x00000020
#define _STRIG4_STRGCMP2_LENGTH                  0x00000001

#define _STRIG4_STRGCMP3_POSITION                0x00000006
#define _STRIG4_STRGCMP3_MASK                    0x00000040
#define _STRIG4_STRGCMP3_LENGTH                  0x00000001

#define _STRIG4_STRGCMP4_POSITION                0x00000007
#define _STRIG4_STRGCMP4_MASK                    0x00000080
#define _STRIG4_STRGCMP4_LENGTH                  0x00000001

#define _STRIG4_STRGCMP5_POSITION                0x00000008
#define _STRIG4_STRGCMP5_MASK                    0x00000100
#define _STRIG4_STRGCMP5_LENGTH                  0x00000001

#define _STRIG4_STRGCMP6_POSITION                0x00000009
#define _STRIG4_STRGCMP6_MASK                    0x00000200
#define _STRIG4_STRGCMP6_LENGTH                  0x00000001

#define _STRIG4_STRGCMP7_POSITION                0x0000000A
#define _STRIG4_STRGCMP7_MASK                    0x00000400
#define _STRIG4_STRGCMP7_LENGTH                  0x00000001

#define _STRIG4_STRGCMP8_POSITION                0x0000000B
#define _STRIG4_STRGCMP8_MASK                    0x00000800
#define _STRIG4_STRGCMP8_LENGTH                  0x00000001

#define _STRIG4_STRGCMP9_POSITION                0x0000000C
#define _STRIG4_STRGCMP9_MASK                    0x00001000
#define _STRIG4_STRGCMP9_LENGTH                  0x00000001

#define _STRIG4_STRGCMP10_POSITION               0x0000000D
#define _STRIG4_STRGCMP10_MASK                   0x00002000
#define _STRIG4_STRGCMP10_LENGTH                 0x00000001

#define _STRIG4_STRGCMP11_POSITION               0x0000000E
#define _STRIG4_STRGCMP11_MASK                   0x00004000
#define _STRIG4_STRGCMP11_LENGTH                 0x00000001

#define _STRIG4_STRGCMP12_POSITION               0x0000000F
#define _STRIG4_STRGCMP12_MASK                   0x00008000
#define _STRIG4_STRGCMP12_LENGTH                 0x00000001

#define _PWMCAP4_PWMCAP_POSITION                 0x00000003
#define _PWMCAP4_PWMCAP_MASK                     0x0000FFF8
#define _PWMCAP4_PWMCAP_LENGTH                   0x0000000D

#define _PWMCAP4_PWMCAP0_POSITION                0x00000003
#define _PWMCAP4_PWMCAP0_MASK                    0x00000008
#define _PWMCAP4_PWMCAP0_LENGTH                  0x00000001

#define _PWMCAP4_PWMCAP1_POSITION                0x00000004
#define _PWMCAP4_PWMCAP1_MASK                    0x00000010
#define _PWMCAP4_PWMCAP1_LENGTH                  0x00000001

#define _PWMCAP4_PWMCAP2_POSITION                0x00000005
#define _PWMCAP4_PWMCAP2_MASK                    0x00000020
#define _PWMCAP4_PWMCAP2_LENGTH                  0x00000001

#define _PWMCAP4_PWMCAP3_POSITION                0x00000006
#define _PWMCAP4_PWMCAP3_MASK                    0x00000040
#define _PWMCAP4_PWMCAP3_LENGTH                  0x00000001

#define _PWMCAP4_PWMCAP4_POSITION                0x00000007
#define _PWMCAP4_PWMCAP4_MASK                    0x00000080
#define _PWMCAP4_PWMCAP4_LENGTH                  0x00000001

#define _PWMCAP4_PWMCAP5_POSITION                0x00000008
#define _PWMCAP4_PWMCAP5_MASK                    0x00000100
#define _PWMCAP4_PWMCAP5_LENGTH                  0x00000001

#define _PWMCAP4_PWMCAP6_POSITION                0x00000009
#define _PWMCAP4_PWMCAP6_MASK                    0x00000200
#define _PWMCAP4_PWMCAP6_LENGTH                  0x00000001

#define _PWMCAP4_PWMCAP7_POSITION                0x0000000A
#define _PWMCAP4_PWMCAP7_MASK                    0x00000400
#define _PWMCAP4_PWMCAP7_LENGTH                  0x00000001

#define _PWMCAP4_PWMCAP8_POSITION                0x0000000B
#define _PWMCAP4_PWMCAP8_MASK                    0x00000800
#define _PWMCAP4_PWMCAP8_LENGTH                  0x00000001

#define _PWMCAP4_PWMCAP9_POSITION                0x0000000C
#define _PWMCAP4_PWMCAP9_MASK                    0x00001000
#define _PWMCAP4_PWMCAP9_LENGTH                  0x00000001

#define _PWMCAP4_PWMCAP10_POSITION               0x0000000D
#define _PWMCAP4_PWMCAP10_MASK                   0x00002000
#define _PWMCAP4_PWMCAP10_LENGTH                 0x00000001

#define _PWMCAP4_PWMCAP11_POSITION               0x0000000E
#define _PWMCAP4_PWMCAP11_MASK                   0x00004000
#define _PWMCAP4_PWMCAP11_LENGTH                 0x00000001

#define _PWMCAP4_PWMCAP12_POSITION               0x0000000F
#define _PWMCAP4_PWMCAP12_MASK                   0x00008000
#define _PWMCAP4_PWMCAP12_LENGTH                 0x00000001

#define _LEBCON4_BPLL_POSITION                   0x00000000
#define _LEBCON4_BPLL_MASK                       0x00000001
#define _LEBCON4_BPLL_LENGTH                     0x00000001

#define _LEBCON4_BPLH_POSITION                   0x00000001
#define _LEBCON4_BPLH_MASK                       0x00000002
#define _LEBCON4_BPLH_LENGTH                     0x00000001

#define _LEBCON4_BPHL_POSITION                   0x00000002
#define _LEBCON4_BPHL_MASK                       0x00000004
#define _LEBCON4_BPHL_LENGTH                     0x00000001

#define _LEBCON4_BPHH_POSITION                   0x00000003
#define _LEBCON4_BPHH_MASK                       0x00000008
#define _LEBCON4_BPHH_LENGTH                     0x00000001

#define _LEBCON4_BCL_POSITION                    0x00000004
#define _LEBCON4_BCL_MASK                        0x00000010
#define _LEBCON4_BCL_LENGTH                      0x00000001

#define _LEBCON4_BCH_POSITION                    0x00000005
#define _LEBCON4_BCH_MASK                        0x00000020
#define _LEBCON4_BCH_LENGTH                      0x00000001

#define _LEBCON4_CLLEBEN_POSITION                0x0000000A
#define _LEBCON4_CLLEBEN_MASK                    0x00000400
#define _LEBCON4_CLLEBEN_LENGTH                  0x00000001

#define _LEBCON4_FLTLEBEN_POSITION               0x0000000B
#define _LEBCON4_FLTLEBEN_MASK                   0x00000800
#define _LEBCON4_FLTLEBEN_LENGTH                 0x00000001

#define _LEBCON4_PLF_POSITION                    0x0000000C
#define _LEBCON4_PLF_MASK                        0x00001000
#define _LEBCON4_PLF_LENGTH                      0x00000001

